<?php
function GetFactionName($race_class_res_id){
	$Faction = Array(
		'Лига'		=> Array('41238'),
		'Империя'		=> Array('41240')

	);
	
	return SearchArray($Faction, $race_class_res_id);
	
}
	
function GetClassName($race_class_res_id){
	$Class = Array(
		'Воин'		=> Array('411435013', '411435014', '411435089', '411435099', '61117'),
		'Храмовник'		=> Array('411435018', '411435030', '411435056', '411435057', '61120'),
		'Волшебник'			=> Array('237546511', '411435016', '411435110', '411435041', '411435047', '64104'),
		'Мистик'	=> Array('237546519', '411435040', '411435050', '411435067', '64105'),
		'Бард'			=> Array('274401304', '274401320', '274401331', '274401332', '274401281'),
		'Жрец'		=> Array('411435011', '411435028', '411435043', '411435053', '61119'),
		'Некромант'		=> Array('411435021', '411435008', '411435032', '61121'),
		'Разведчик'			=> Array('411435042', '411435051', '411435087', '411435088', '61123'),
		'Язычник'		=> Array('411435054', '411435055', '411435071', '64103')
	);
	
	return SearchArray($Class, $race_class_res_id);
	
}
function GetRaceName($race_class_res_id){
	$Races = Array(
		'Хадаган'	=> Array('237546511', '274401304', '411435021', '411435028', '411435030', '411435050', '411435051', '411435099'),
		'Кания'		=> Array('274401332', '411435013', '411435041', '411435053', '411435055', '411435057', '411435087', '411435110'),
		'Эльфы'			=> Array('237546519', '274401320', '411435018', '411435008', '411435043', '411435047'),
		'Орки'			=> Array('274401331', '411435014', '411435054', '411435056', '411435088'),
		'Восставшие'		=> Array('411435011', '411435016', '411435032', '411435067'),
		'Гибберлинги'	=> Array('411435040', '411435042', '411435071', '411435089')
	);
	
return SearchArray($Races, $race_class_res_id);
	
}
function SearchArray($Array, $Search) {
    foreach($Array as $index => $Value) {
      foreach($Value as $A) {
        if($A == $Search) return $index;
      }
    }
    return false;
}

	?>